src/jvm/tools.org
#+TITLE: JDK工具
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: gc.html   
#+HTML_LINK_HOME: jvm.html
#+OPTIONS: num:nil timestamp:nil


* 命令行工具
  
  给一个系统定位问题的时候，知识、经验是关键基础，数据是依据。工具是运用知识处理数据的手段。这里说的数据包括：
+ 运行日志
+ 异常堆栈
+ GC日志
+ 线程快照文件( _threaddump_ ) 文件
+ 堆转储快照 ( _heapdump/hprof_ ) 文件
  
  
#+CAPTION: SUN JDK监控和故障处理工具
#+ATTR_HTML: :border 1 :rules all :frame boader
| 名称  | 主要作用 |
| jps   | jvm process status tool,显示指定系统内所有的hotspot虚拟机进程 |
| jstat     | jvm statistics monitoring tool,用于收集hotspot虚拟机各方面的运行数据 |
| jinfo     | configuration info for java，显示虚拟机配置信息 |
| jmap  | memory map for java,生成虚拟机的内存转储快照（heapdump文件） |
| jhat  | jvm heap dump browser，用于分析heapmap文件，它会建立一个http/html服务器让用户可以在浏览器上查看分析结果 |
| jstack    | stack trace for java ,显示虚拟机的线程快照 |


** jps
   jps( _JVM Process Status Tool_ )可以 *列出正在运行的虚拟机进程，并显示虚拟机执行主类名称以及这些进程的本地虚拟机唯一ID* 。是使用频率最高的JDK命令行工具，因为其他的JDK工具大多需要输入它查询到的LVMID来确定要监控的是哪一个虚拟机进程。对于本地虚拟机进程来说，LVMID与操作系统的进程ID是一致的，使用任务管理器也能查询到虚拟机进程的LVMID，但是如果启动了多个虚拟机进程，无法根据进程名称定位时，就只能依赖jps命令来显示主类的功能才能区分了
   
   
*** 格式
    #+BEGIN_EXAMPLE
    jps [options] [hostid]
    #+END_EXAMPLE
    
    
    #+CAPTION: jps常用options
    #+ATTR_HTML: :border 1 :rules all :frame boader
    | 属性  | 作用 |
    | -p        | 只输出LVMID，省略主类的名称 |
    | -m        | 输出虚拟机进程启动时传递给主类main（）函数的参数 |
    | -l        | 输出主类的全名，如果进程执行的是jar包，输出jar路径 |
    | -v        | 输出虚拟机进程启动时jvm参数 |
    
    
*** 实例
    下面是在linux上执行 *jps -l* 的例子，可以看到tomcat服务器的信息：
    
    #+BEGIN_SRC sh
  [root@AY131228205040795d8cZ bin]# jps -l  
  7862 org.apache.catalina.startup.Bootstrap  
  1356 sun.tools.jps.Jps
    #+END_SRC
    
** jstat
   jstat( _JVM Statistics Monitoring Tool_ ) 是用于 *监视虚拟机各种运行状态信息* 的命令行工具，它可以显示本地或者远程虚拟机进程中的类装载、内存、垃圾收集、JIT编译等运行数据，在没有GUI图形界面，只提供了纯文本控制台环境的服务器上，它将是运行期定位虚拟机性能问题的首选工具
   
*** 格式
    #+BEGIN_EXAMPLE
    jstat [option vmid [interval [s|ms] [count]] ]
    #+END_EXAMPLE
    
+ VMID和LVMID：
  + 如果是本地虚拟机进程：VMID和LVMID是一致的
  + 如果是远程虚拟机：那VMID的格式应当是： _[protocol:] [//] lvmid[@hostname[:port]/servername]_ 
+ interval: 查询的间隔，省略为1
+ count：查询的次数，省略为1
  
#+CAPTION: jstat常用options
#+ATTR_HTML: :border 1 :rules all :frame boader
| 选项              | 作用                                                                                       |
| -class            | 监视装载类、卸载类、总空间以及类装载所耗费的时间                     |
| -gc               | 监视java堆状况，包括eden区、两个survivor区、老年代、永久代等的容量、已用空间、GC时间合计信息 |
| -gccapacity       | 监视内容与-gc基本相同，但输出主要关注java堆各个区域使用到最大、最小空间 |
| -gcutil           | 监视内容与-gc基本相同，但输出主要关注已使用控件占总空间的百分比 |
| -gccause          | 与-gcutil功能一样，但是会额外输出导致上一次gc产生的原因               |
| -gcnew            | 监视新生代GC情况                                                                      |
| -gcnewcapacity    | 监视内容与-gcnew基本相同，输出主要关注使用到的最大、最小空间      |
| -gcold            | 监视老年代GC情况                                                                      |
| -gcoldcapacity    | 监视内容与-gcold基本相同，输出主要关注使用到的最大、最小空间      |
| -gcpermcapacity   | 输出永久代使用到的最大、最小空间                                             |
| -compiler         | 输出JIT编译过的方法、耗时等信息                                                |
| -printcompilation | 输出已经被JIT编译过的方法                                                         |

#+CAPTION: jstat输出
#+ATTR_HTML: :border 1 :rules all :frame boader
| S0   | Heap上的 Survivor space 0 区已使用空间的百分比 |
| S1   | Heap上的 Survivor space 1 区已使用空间的百分比 |
| E    | Heap上的 Eden space 区已使用空间的百分比 |
| O    | Heap上的 Old space 区已使用空间的百分比 |
| P    | Perm space 区已使用空间的百分比          |
| YGC  | 从应用程序启动到采样时发生 Young GC 的次数 |
| YGCT | 从应用程序启动到采样时 Young GC 所用的时间(单位秒) |
| FGC  | 从应用程序启动到采样时发生 Full GC 的次数 |
| FGCT | 从应用程序启动到采样时 Full GC 所用的时间(单位秒) |
| GCT  | 从应用程序启动到采样时用于垃圾回收的总时间(单位秒) |

*** 实例
    #+BEGIN_SRC sh
  [root@AY131228205040795d8cZ bin]# jstat -gcutil 7862  
  S0     S1     E      O      P     YGC     YGCT    FGC    FGCT     GCT     
  5.17   0.00  49.73  99.81  82.29    716    7.960    10    4.083   12.044  
    #+END_SRC
    
** jinfo
   jinfo（ _Configuration Info for Java_ ）可观察 *运行中的java程序的运行环境参数* ，参数：
+ Java System属性
+ JVM命令行参数
  
也可从core文件里面知道崩溃的Java应用程序的配置信息

*** 格式
    #+BEGIN_EXAMPLE
    jinfo [option] pid
    #+END_EXAMPLE
    
*** 实例
    #+BEGIN_SRC sh
  [root@AY131228205040795d8cZ bin]# jinfo -flag CMSInitiatingOccupancyFraction 7862  
  -XX:CMSInitiatingOccupancyFraction=-1  
    #+END_SRC
    
** jmap
   jmap（ _Memory Map for Java_ ）命令用于 *生成堆转储快照* （一般称为 _headdump或dump_ 文件）。还可以 *查询finalize执行队列，Java堆和永久代的详细信息，如空间使用率、当前用的是哪种收集器* 等
   
