html/jvm/tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JDK工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="gc.html"> UP </a>
 |
 <a accesskey="H" href="jvm.html"> HOME </a>
</div><div id="content">
<h1 class="title">JDK工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge9e5927">命令行工具</a>
<ul>
<li><a href="#org580c17f">jps</a>
<ul>
<li><a href="#org9b6be28">格式</a></li>
<li><a href="#org992660a">实例</a></li>
</ul>
</li>
<li><a href="#org5f135a0">jstat</a>
<ul>
<li><a href="#orga79d9a8">格式</a></li>
<li><a href="#orgff6498d">实例</a></li>
</ul>
</li>
<li><a href="#org976d9cf">jinfo</a>
<ul>
<li><a href="#orgc61976a">格式</a></li>
<li><a href="#orge6126fc">实例</a></li>
</ul>
</li>
<li><a href="#org0d5b9ff">jmap</a>
<ul>
<li><a href="#org28dfb92">格式</a></li>
<li><a href="#org53ce0e2">实例</a></li>
</ul>
</li>
<li><a href="#org93d9c1f">jhat</a></li>
<li><a href="#org267a0af">jstack</a>
<ul>
<li><a href="#org1db8b9e">格式</a></li>
<li><a href="#orgec51bfa">实例</a></li>
<li><a href="#org36a8a02">getAllStackTrace</a></li>
</ul>
</li>
<li><a href="#org6845887">HSDIS</a></li>
</ul>
</li>
<li><a href="#org258492b">可视化工具</a>
<ul>
<li><a href="#orgf081096">JConsole</a></li>
<li><a href="#org48dcf1f">VisualVM</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orge9e5927" class="outline-2">
<h2 id="orge9e5927">命令行工具</h2>
<div class="outline-text-2" id="text-orge9e5927">
<p>
给一个系统定位问题的时候，知识、经验是关键基础，数据是依据。工具是运用知识处理数据的手段。这里说的数据包括：
</p>
<ul class="org-ul">
<li>运行日志</li>
<li>异常堆栈</li>
<li>GC日志</li>
<li>线程快照文件( <span class="underline">threaddump</span> ) 文件</li>
<li>堆转储快照 ( <span class="underline">heapdump/hprof</span> ) 文件</li>
</ul>


<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> SUN JDK监控和故障处理工具</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">名称</td>
<td class="org-left">主要作用</td>
</tr>

<tr>
<td class="org-left">jps</td>
<td class="org-left">jvm process status tool,显示指定系统内所有的hotspot虚拟机进程</td>
</tr>

<tr>
<td class="org-left">jstat</td>
<td class="org-left">jvm statistics monitoring tool,用于收集hotspot虚拟机各方面的运行数据</td>
</tr>

<tr>
<td class="org-left">jinfo</td>
<td class="org-left">configuration info for java，显示虚拟机配置信息</td>
</tr>

<tr>
<td class="org-left">jmap</td>
<td class="org-left">memory map for java,生成虚拟机的内存转储快照（heapdump文件）</td>
</tr>

<tr>
<td class="org-left">jhat</td>
<td class="org-left">jvm heap dump browser，用于分析heapmap文件，它会建立一个http/html服务器让用户可以在浏览器上查看分析结果</td>
</tr>

<tr>
<td class="org-left">jstack</td>
<td class="org-left">stack trace for java ,显示虚拟机的线程快照</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org580c17f" class="outline-3">
<h3 id="org580c17f">jps</h3>
<div class="outline-text-3" id="text-org580c17f">
<p>
jps( <span class="underline">JVM Process Status Tool</span> )可以 <b>列出正在运行的虚拟机进程，并显示虚拟机执行主类名称以及这些进程的本地虚拟机唯一ID</b> 。是使用频率最高的JDK命令行工具，因为其他的JDK工具大多需要输入它查询到的LVMID来确定要监控的是哪一个虚拟机进程。对于本地虚拟机进程来说，LVMID与操作系统的进程ID是一致的，使用任务管理器也能查询到虚拟机进程的LVMID，但是如果启动了多个虚拟机进程，无法根据进程名称定位时，就只能依赖jps命令来显示主类的功能才能区分了
</p>
</div>


<div id="outline-container-org9b6be28" class="outline-4">
<h4 id="org9b6be28">格式</h4>
<div class="outline-text-4" id="text-org9b6be28">
<pre class="example">
jps [options] [hostid]
</pre>


<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 2:</span> jps常用options</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">属性</td>
<td class="org-left">作用</td>
</tr>

<tr>
<td class="org-left">-p</td>
<td class="org-left">只输出LVMID，省略主类的名称</td>
</tr>

<tr>
<td class="org-left">-m</td>
<td class="org-left">输出虚拟机进程启动时传递给主类main（）函数的参数</td>
</tr>

<tr>
<td class="org-left">-l</td>
<td class="org-left">输出主类的全名，如果进程执行的是jar包，输出jar路径</td>
</tr>

<tr>
<td class="org-left">-v</td>
<td class="org-left">输出虚拟机进程启动时jvm参数</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org992660a" class="outline-4">
<h4 id="org992660a">实例</h4>
<div class="outline-text-4" id="text-org992660a">
<p>
下面是在linux上执行 <b>jps -l</b> 的例子，可以看到tomcat服务器的信息：
</p>

<div class="org-src-container">
<pre class="src src-sh">[root@AY131228205040795d8cZ bin]# jps -l  
7862 org.apache.catalina.startup.Bootstrap  
1356 sun.tools.jps.Jps
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5f135a0" class="outline-3">
<h3 id="org5f135a0">jstat</h3>
<div class="outline-text-3" id="text-org5f135a0">
<p>
jstat( <span class="underline">JVM Statistics Monitoring Tool</span> ) 是用于 <b>监视虚拟机各种运行状态信息</b> 的命令行工具，它可以显示本地或者远程虚拟机进程中的类装载、内存、垃圾收集、JIT编译等运行数据，在没有GUI图形界面，只提供了纯文本控制台环境的服务器上，它将是运行期定位虚拟机性能问题的首选工具
</p>
</div>

<div id="outline-container-orga79d9a8" class="outline-4">
<h4 id="orga79d9a8">格式</h4>
<div class="outline-text-4" id="text-orga79d9a8">
<pre class="example">
jstat [option vmid [interval [s|ms] [count]] ]
</pre>

<ul class="org-ul">
<li>VMID和LVMID：
<ul class="org-ul">
<li>如果是本地虚拟机进程：VMID和LVMID是一致的</li>
<li>如果是远程虚拟机：那VMID的格式应当是： <span class="underline">[protocol:] [//] lvmid[@hostname[:port]/servername]</span></li>
</ul></li>
<li>interval: 查询的间隔，省略为1</li>
<li>count：查询的次数，省略为1</li>
</ul>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 3:</span> jstat常用options</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">选项</td>
<td class="org-left">作用</td>
</tr>

<tr>
<td class="org-left">-class</td>
<td class="org-left">监视装载类、卸载类、总空间以及类装载所耗费的时间</td>
</tr>

<tr>
<td class="org-left">-gc</td>
<td class="org-left">监视java堆状况，包括eden区、两个survivor区、老年代、永久代等的容量、已用空间、GC时间合计信息</td>
</tr>

<tr>
<td class="org-left">-gccapacity</td>
<td class="org-left">监视内容与-gc基本相同，但输出主要关注java堆各个区域使用到最大、最小空间</td>
</tr>

<tr>
<td class="org-left">-gcutil</td>
<td class="org-left">监视内容与-gc基本相同，但输出主要关注已使用控件占总空间的百分比</td>
</tr>

<tr>
<td class="org-left">-gccause</td>
<td class="org-left">与-gcutil功能一样，但是会额外输出导致上一次gc产生的原因</td>
</tr>

<tr>
<td class="org-left">-gcnew</td>
<td class="org-left">监视新生代GC情况</td>
</tr>

<tr>
<td class="org-left">-gcnewcapacity</td>
<td class="org-left">监视内容与-gcnew基本相同，输出主要关注使用到的最大、最小空间</td>
</tr>

<tr>
<td class="org-left">-gcold</td>
<td class="org-left">监视老年代GC情况</td>
</tr>

<tr>
<td class="org-left">-gcoldcapacity</td>
<td class="org-left">监视内容与-gcold基本相同，输出主要关注使用到的最大、最小空间</td>
</tr>

<tr>
<td class="org-left">-gcpermcapacity</td>
<td class="org-left">输出永久代使用到的最大、最小空间</td>
</tr>

<tr>
<td class="org-left">-compiler</td>
<td class="org-left">输出JIT编译过的方法、耗时等信息</td>
</tr>

<tr>
<td class="org-left">-printcompilation</td>
<td class="org-left">输出已经被JIT编译过的方法</td>
</tr>
</tbody>
</table>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 4:</span> jstat输出</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">S0</td>
<td class="org-left">Heap上的 Survivor space 0 区已使用空间的百分比</td>
</tr>

<tr>
<td class="org-left">S1</td>
<td class="org-left">Heap上的 Survivor space 1 区已使用空间的百分比</td>
</tr>

<tr>
<td class="org-left">E</td>
<td class="org-left">Heap上的 Eden space 区已使用空间的百分比</td>
</tr>

<tr>
<td class="org-left">O</td>
<td class="org-left">Heap上的 Old space 区已使用空间的百分比</td>
</tr>

<tr>
<td class="org-left">P</td>
<td class="org-left">Perm space 区已使用空间的百分比</td>
</tr>

<tr>
<td class="org-left">YGC</td>
<td class="org-left">从应用程序启动到采样时发生 Young GC 的次数</td>
</tr>

<tr>
<td class="org-left">YGCT</td>
<td class="org-left">从应用程序启动到采样时 Young GC 所用的时间(单位秒)</td>
</tr>

<tr>
<td class="org-left">FGC</td>
<td class="org-left">从应用程序启动到采样时发生 Full GC 的次数</td>
</tr>

<tr>
<td class="org-left">FGCT</td>
<td class="org-left">从应用程序启动到采样时 Full GC 所用的时间(单位秒)</td>
</tr>

<tr>
<td class="org-left">GCT</td>
<td class="org-left">从应用程序启动到采样时用于垃圾回收的总时间(单位秒)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgff6498d" class="outline-4">
<h4 id="orgff6498d">实例</h4>
<div class="outline-text-4" id="text-orgff6498d">
<div class="org-src-container">
<pre class="src src-sh">[root@AY131228205040795d8cZ bin]# jstat -gcutil 7862  
S0     S1     E      O      P     YGC     YGCT    FGC    FGCT     GCT     
5.17   0.00  49.73  99.81  82.29    716    7.960    10    4.083   12.044  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org976d9cf" class="outline-3">
<h3 id="org976d9cf">jinfo</h3>
<div class="outline-text-3" id="text-org976d9cf">
<p>
jinfo（ <span class="underline">Configuration Info for Java</span> ）可观察 <b>运行中的java程序的运行环境参数</b> ，参数：
</p>
<ul class="org-ul">
<li>Java System属性</li>
<li>JVM命令行参数</li>
</ul>

<p>
也可从core文件里面知道崩溃的Java应用程序的配置信息
</p>
</div>

<div id="outline-container-orgc61976a" class="outline-4">
<h4 id="orgc61976a">格式</h4>
<div class="outline-text-4" id="text-orgc61976a">
<pre class="example">
jinfo [option] pid
</pre>
</div>
</div>

<div id="outline-container-orge6126fc" class="outline-4">
<h4 id="orge6126fc">实例</h4>
<div class="outline-text-4" id="text-orge6126fc">
<div class="org-src-container">
<pre class="src src-sh">[root@AY131228205040795d8cZ bin]# jinfo -flag CMSInitiatingOccupancyFraction 7862  
-XX:<span style="color: #4eee94;">CMSInitiatingOccupancyFraction</span>=-1  
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d5b9ff" class="outline-3">
<h3 id="org0d5b9ff">jmap</h3>
<div class="outline-text-3" id="text-org0d5b9ff">
<p>
jmap（ <span class="underline">Memory Map for Java</span> ）命令用于 <b>生成堆转储快照</b> （一般称为 <span class="underline">headdump或dump</span> 文件）。还可以 <b>查询finalize执行队列，Java堆和永久代的详细信息，如空间使用率、当前用的是哪种收集器</b> 等
</p>
</div>
