src/jvm/tools.org
*** 格式
    #+BEGIN_EXAMPLE
    jmap [option] vmid
    #+END_EXAMPLE
    
    #+CAPTION: jmap常用options
    #+ATTR_HTML: :border 1 :rules all :frame boader
    | -dump          | 生成java堆转储快照。格式为： -dump:[live,]format=b,file=,其中live子参数说明是否只dump出存活的对象 |
    | -finalizerinfo | 显示在F-Queue中等待Finalizer线程执行finalize方法的对象。只在Linux/Solaris平台下有效 |
    | -heap          | 显示java堆详细信息，如使用哪种收集器、参数配置、分代情况等，在Linux/Solaris平台下有效 |
    | -jisto         | 显示堆中对象统计信息，包含类、实例对象、合集容量                          |
    | -permstat      | 以ClassLoader为统计口径显示永久代内存状态。只在Linux/Solaris平台下有效     |
    | -F             | 当虚拟机进程对-dump选项没有相应时。可使用这个选项强制生成dump快照。只在Linux/Solaris平台下有效 |
    
*** 实例
    #+BEGIN_SRC sh
  #观察到java heap的内存使用情况
  [root@localhost bin]# jmap -heap 2083
  #观察heap中所有对象的情况，包括对象数量和所占空间大
  [root@localhost bin]# jmap -histo 2083 
  [root@localhost bin]# jmap -histo:live 2083
  #dump出所有对象文件可用于进一步分析
  [root@localhost bin]# jmap -dump:format=b,file=heap.bin 2083 
  #dump出存活的对象文件可用于进一步分析
  [root@localhost bin]# jmap -dump:live,format=b,file=heap.bin 2083
    #+END_SRC
    
** jhat
   jhat（ _JVM Heap Analysis Tool_ ）与jmap搭配使用， *分析jmap生成的堆转储快照* 。jhat内置了一个微型的HTTP/HTML服务器，生成dump文件的分析结果后，可以在浏览器中查看。不过在实际中不使用jhat来分析dump，主要原因：
1. 一般不在部署应用的服务器上直接分析dump文件，而要复制到其他机器上进行分析，因为是耗时且消耗硬件资源
2. jhat功能比较简陋，如VisualVM，Eclipse Momery Analyzer、IBM HeapAnalyzer等都更强大
   
** jstack
   jstack（ _Stack Trace for Java_ ）命令用于 *生成虚拟机当前时刻的线程快照* （一般称为 _thread dump_ ）。线程快照就是当前虚拟机内每一条线程正在执行的的方法堆栈的集合，生成线程快照的主要目的是定位线程出现长时间停顿的原因，如线程间的死锁、死循环、请求外部资源导致的长时间等待等都是导致线程长时间停顿的原因
   
*** 格式
    #+BEGIN_EXAMPLE
    jstack [option] vmid
    #+END_EXAMPLE
    
    #+CAPTION: jstack常用options
    #+ATTR_HTML: :border 1 :rules all :frame boader
    | 选项  | 作用 |
    | -F        | 当正常输出的请求不被响应时，强制输出线程堆栈 |
    | -l        | 除堆栈外，显示关于锁的附加信息 |
    | -m        | 如果调用到本地方法的话，可以显示c/c++的堆栈 |
    
*** 实例
    #+BEGIN_SRC sh
  [root@AY131228205040795d8cZ yuxi]# jstack -l 7862  
  2014-06-12 11:04:05  
  Full thread dump Java HotSpot(TM) 64-Bit Server VM (20.45-b01 mixed mode):  

  "Attach Listener" daemon prio=10 tid=0x00007f6a84013800 nid=0xa8f waiting on condition [0x0000000000000000]  
  java.lang.Thread.State: RUNNABLE  

  Locked ownable synchronizers:  
  - None  

  "http-bio-8080-exec-345" daemon prio=10 tid=0x00007f6a980ee000 nid=0x5e31 waiting on condition [0x00007f6a715d4000]  
  java.lang.Thread.State: WAITING (parking)  
  at sun.misc.Unsafe.park(Native Method)  
  - parking to wait for  <0x00000000e22bf280> (a java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject)  
  at java.util.concurrent.locks.LockSupport.park(LockSupport.java:156)  
  at java.util.concurrent.locks.AbstractQueuedSynchronizer$ConditionObject.await(AbstractQueuedSynchronizer.java:1987)  
  at java.util.concurrent.LinkedBlockingQueue.take(LinkedBlockingQueue.java:399)  
  at org.apache.tomcat.util.threads.TaskQueue.take(TaskQueue.java:104)  
  at org.apache.tomcat.util.threads.TaskQueue.take(TaskQueue.java:32)  
  at java.util.concurrent.ThreadPoolExecutor.getTask(ThreadPoolExecutor.java:957)  
  at java.util.concurrent.ThreadPoolExecutor$Worker.run(ThreadPoolExecutor.java:917)  
  at java.lang.Thread.run(Thread.java:662)  

  Locked ownable synchronizers:  
  - None  
    #+END_SRC
    
*** getAllStackTrace
    JDK1.5中，java.lang.Thread类新增了一个 _getAllStackTrace()_ 方法用于 *获取虚拟机中所有线程的StackTraceElement对象* 。使用这个方法可以通过简单的几行代码就完成jstack的大部分功能，在实际项目可以调用这个方法做个管理员页面，可以随时使用浏览器查看线程堆栈，如代码所示：
    
    #+BEGIN_SRC html
  <%@ page language="java" import="java.util.*" pageEncoding="UTF-8"%>  
  <html>  
    <head>  
      <title>服务器线程信息</title>  
    </head>  
    <body>  
      <pre>  
        <%  
          for(Map.Entry<Thread, StackTraceElement[]> stackTrace : Thread.getAllStackTraces().entrySet()){  
          Thread thread = (Thread)stackTrace.getKey();  
          StackTraceElement[] stack = (StackTraceElement[])stackTrace.getValue();  
          if(thread.equals(Thread.currentThread())){  
          continue;  
          }  
          out.print("\n线程:"+thread.getName()+"\n");  
          for(StackTraceElement element : stack){  
          out.print("\t"+element+"\n");  
          }  
          }  
          %>  
      </pre>  
    </body>  
  </html>  
    #+END_SRC
    
