html/jvm/tools.html

<div id="outline-container-org28dfb92" class="outline-4">
<h4 id="org28dfb92">格式</h4>
<div class="outline-text-4" id="text-org28dfb92">
<pre class="example">
jmap [option] vmid
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 5:</span> jmap常用options</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">-dump</td>
<td class="org-left">生成java堆转储快照。格式为： -dump:[live,]format=b,file=,其中live子参数说明是否只dump出存活的对象</td>
</tr>

<tr>
<td class="org-left">-finalizerinfo</td>
<td class="org-left">显示在F-Queue中等待Finalizer线程执行finalize方法的对象。只在Linux/Solaris平台下有效</td>
</tr>

<tr>
<td class="org-left">-heap</td>
<td class="org-left">显示java堆详细信息，如使用哪种收集器、参数配置、分代情况等，在Linux/Solaris平台下有效</td>
</tr>

<tr>
<td class="org-left">-jisto</td>
<td class="org-left">显示堆中对象统计信息，包含类、实例对象、合集容量</td>
</tr>

<tr>
<td class="org-left">-permstat</td>
<td class="org-left">以ClassLoader为统计口径显示永久代内存状态。只在Linux/Solaris平台下有效</td>
</tr>

<tr>
<td class="org-left">-F</td>
<td class="org-left">当虚拟机进程对-dump选项没有相应时。可使用这个选项强制生成dump快照。只在Linux/Solaris平台下有效</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org53ce0e2" class="outline-4">
<h4 id="org53ce0e2">实例</h4>
<div class="outline-text-4" id="text-org53ce0e2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#35266;&#23519;&#21040;java heap&#30340;&#20869;&#23384;&#20351;&#29992;&#24773;&#20917;</span>
[root@localhost bin]# jmap -heap 2083
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">&#35266;&#23519;heap&#20013;&#25152;&#26377;&#23545;&#35937;&#30340;&#24773;&#20917;&#65292;&#21253;&#25324;&#23545;&#35937;&#25968;&#37327;&#21644;&#25152;&#21344;&#31354;&#38388;&#22823;</span>
[root@localhost bin]# jmap -histo 2083 
[root@localhost bin]# jmap -histo:live 2083
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">dump&#20986;&#25152;&#26377;&#23545;&#35937;&#25991;&#20214;&#21487;&#29992;&#20110;&#36827;&#19968;&#27493;&#20998;&#26512;</span>
[root@localhost bin]# jmap -dump:<span style="color: #4eee94;">format</span>=b,<span style="color: #4eee94;">file</span>=heap.bin 2083 
<span style="color: #5f9ea0; font-style: italic;">#</span><span style="color: #5f9ea0; font-style: italic;">dump&#20986;&#23384;&#27963;&#30340;&#23545;&#35937;&#25991;&#20214;&#21487;&#29992;&#20110;&#36827;&#19968;&#27493;&#20998;&#26512;</span>
[root@localhost bin]# jmap -dump:live,<span style="color: #4eee94;">format</span>=b,<span style="color: #4eee94;">file</span>=heap.bin 2083
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org93d9c1f" class="outline-3">
<h3 id="org93d9c1f">jhat</h3>
<div class="outline-text-3" id="text-org93d9c1f">
<p>
jhat（ <span class="underline">JVM Heap Analysis Tool</span> ）与jmap搭配使用， <b>分析jmap生成的堆转储快照</b> 。jhat内置了一个微型的HTTP/HTML服务器，生成dump文件的分析结果后，可以在浏览器中查看。不过在实际中不使用jhat来分析dump，主要原因：
</p>
<ol class="org-ol">
<li>一般不在部署应用的服务器上直接分析dump文件，而要复制到其他机器上进行分析，因为是耗时且消耗硬件资源</li>
<li>jhat功能比较简陋，如VisualVM，Eclipse Momery Analyzer、IBM HeapAnalyzer等都更强大</li>
</ol>
</div>
</div>

<div id="outline-container-org267a0af" class="outline-3">
<h3 id="org267a0af">jstack</h3>
<div class="outline-text-3" id="text-org267a0af">
<p>
jstack（ <span class="underline">Stack Trace for Java</span> ）命令用于 <b>生成虚拟机当前时刻的线程快照</b> （一般称为 <span class="underline">thread dump</span> ）。线程快照就是当前虚拟机内每一条线程正在执行的的方法堆栈的集合，生成线程快照的主要目的是定位线程出现长时间停顿的原因，如线程间的死锁、死循环、请求外部资源导致的长时间等待等都是导致线程长时间停顿的原因
</p>
</div>

<div id="outline-container-org1db8b9e" class="outline-4">
<h4 id="org1db8b9e">格式</h4>
<div class="outline-text-4" id="text-org1db8b9e">
<pre class="example">
jstack [option] vmid
</pre>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 6:</span> jstack常用options</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">选项</td>
<td class="org-left">作用</td>
</tr>

<tr>
<td class="org-left">-F</td>
<td class="org-left">当正常输出的请求不被响应时，强制输出线程堆栈</td>
</tr>

<tr>
<td class="org-left">-l</td>
<td class="org-left">除堆栈外，显示关于锁的附加信息</td>
</tr>

<tr>
<td class="org-left">-m</td>
<td class="org-left">如果调用到本地方法的话，可以显示c/c++的堆栈</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgec51bfa" class="outline-4">
<h4 id="orgec51bfa">实例</h4>
<div class="outline-text-4" id="text-orgec51bfa">
<div class="org-src-container">
<pre class="src src-sh">[root@AY131228205040795d8cZ yuxi]# jstack -l 7862  
2014-06-12 11:04:05  
Full thread dump Java HotSpot(TM) 64-Bit Server VM (20.45-b01 mixed mode):  

<span style="color: #deb887;">"Attach Listener"</span> daemon <span style="color: #4eee94;">prio</span>=10 <span style="color: #4eee94;">tid</span>=0x00007f6a84013800 <span style="color: #4eee94;">nid</span>=0xa8f waiting on condition [0x0000000000000000]  
java.lang.Thread.State: RUNNABLE  

Locked ownable synchronizers:  
- None  

<span style="color: #deb887;">"http-bio-8080-exec-345"</span> daemon <span style="color: #4eee94;">prio</span>=10 <span style="color: #4eee94;">tid</span>=0x00007f6a980ee000 <span style="color: #4eee94;">nid</span>=0x5e31 waiting on condition [0x00007f6a715d4000]  
java.lang.Thread.State: WAITING (parking)  
at sun.misc.Unsafe.park(Native Method)  
- parking to wait for  &lt;0x00000000e22bf280&gt; (a java.util.concurrent.locks.AbstractQueuedSynchronizer$<span style="color: #4eee94;">ConditionObject</span>)  
at java.util.concurrent.locks.LockSupport.park(LockSupport.java:156)  
at java.util.concurrent.locks.AbstractQueuedSynchronizer$<span style="color: #4eee94;">ConditionObject</span>.await(AbstractQueuedSynchronizer.java:1987)  
at java.util.concurrent.LinkedBlockingQueue.take(LinkedBlockingQueue.java:399)  
at org.apache.tomcat.util.threads.TaskQueue.take(TaskQueue.java:104)  
at org.apache.tomcat.util.threads.TaskQueue.take(TaskQueue.java:32)  
at java.util.concurrent.ThreadPoolExecutor.getTask(ThreadPoolExecutor.java:957)  
at java.util.concurrent.ThreadPoolExecutor$<span style="color: #4eee94;">Worker</span>.run(ThreadPoolExecutor.java:917)  
at java.lang.Thread.run(Thread.java:662)  

Locked ownable synchronizers:  
- None  
</pre>
</div>
</div>
</div>

<div id="outline-container-org36a8a02" class="outline-4">
<h4 id="org36a8a02">getAllStackTrace</h4>
<div class="outline-text-4" id="text-org36a8a02">
<p>
JDK1.5中，java.lang.Thread类新增了一个 <span class="underline">getAllStackTrace()</span> 方法用于 <b>获取虚拟机中所有线程的StackTraceElement对象</b> 。使用这个方法可以通过简单的几行代码就完成jstack的大部分功能，在实际项目可以调用这个方法做个管理员页面，可以随时使用浏览器查看线程堆栈，如代码所示：
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;%@ page <span style="color: #4eee94;">language</span>=<span style="color: #deb887;">"java"</span> <span style="color: #4eee94;">import</span>=<span style="color: #deb887;">"java.util.*"</span> <span style="color: #4eee94;">pageEncoding</span>=<span style="color: #deb887;">"UTF-8"</span>%&gt;  
&lt;<span style="color: #daa520; font-weight: bold;">html</span>&gt;  
  &lt;<span style="color: #daa520; font-weight: bold;">head</span>&gt;  
    &lt;<span style="color: #daa520; font-weight: bold;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">&#26381;&#21153;&#22120;&#32447;&#31243;&#20449;&#24687;</span>&lt;/<span style="color: #daa520; font-weight: bold;">title</span>&gt;  
  &lt;/<span style="color: #daa520; font-weight: bold;">head</span>&gt;  
  &lt;<span style="color: #daa520; font-weight: bold;">body</span>&gt;  
    &lt;<span style="color: #daa520; font-weight: bold;">pre</span>&gt;  
      &lt;%  
        for(Map.Entry&lt;<span style="color: #daa520; font-weight: bold;">Thread</span>, StackTraceElement[]&gt; stackTrace : Thread.getAllStackTraces().entrySet()){  
        Thread thread = (Thread)stackTrace.getKey();  
        StackTraceElement[] stack = (StackTraceElement[])stackTrace.getValue();  
        if(thread.equals(Thread.currentThread())){  
        continue;  
        }  
        out.print(<span style="color: #deb887;">"\n&#32447;&#31243;:"</span>+thread.getName()+<span style="color: #deb887;">"\n"</span>);  
        for(StackTraceElement element : stack){  
        out.print(<span style="color: #deb887;">"\t"</span>+element+<span style="color: #deb887;">"\n"</span>);  
        }  
        }  
        %&gt;  
    &lt;/<span style="color: #daa520; font-weight: bold;">pre</span>&gt;  
  &lt;/<span style="color: #daa520; font-weight: bold;">body</span>&gt;  
&lt;/<span style="color: #daa520; font-weight: bold;">html</span>&gt;  
</pre>
</div>
</div>
</div>
</div>
